import sys
import pytest
from pathlib import Path

PATH_SRC = Path(__file__).resolve().parents[1]
if str(PATH_SRC) not in sys.path:
    sys.path.append(str(PATH_SRC))
from invest_algorithms.algo_pyramid import (
    get單位價格差,
    getLst買入價格,
    get本階投入資金百分比,
    get累計下跌百分比,
    etl_percentage,
    get本階下單資料,
    get一組等差金字塔下單資料,
    get買入等差金字塔,
    get一組等比金字塔下單資料,
    get買入等比金字塔,
)


@pytest.mark.parametrize(
    "flt_起始價格, flt最終價格, int_交易次數, expected",
    [
        (100.0, 50.0, 10, 5.0),
        (200.0, 100.0, 20, 5.0),
        (300.0, 200.0, 10, 10.0),
        (400.0, 300.0, 20, 5.0),
    ],
)
def test_get單位價格差(flt_起始價格, flt最終價格, int_交易次數, expected):
    assert get單位價格差(flt_起始價格, flt最終價格, int_交易次數) == expected


@pytest.mark.parametrize(
    "flt_起始價格, flt_單位價格差, int_交易次數, expected",
    [
        (100.0, 5.0, 10, [95.0, 90.0, 85.0, 80.0, 75.0, 70.0, 65.0, 60.0, 55.0, 50.0]),
        (200.0, 10.0, 5, [190.0, 180.0, 170.0, 160.0, 150.0]),
        (300.0, 15.0, 3, [285.0, 270.0, 255.0]),
        (400.0, 20.0, 2, [380.0, 360.0]),
    ],
)
def test_getLst買入價格(flt_起始價格, flt_單位價格差, int_交易次數, expected):
    assert getLst買入價格(flt_起始價格, flt_單位價格差, int_交易次數) == expected


@pytest.mark.parametrize(
    "flt_一組金字塔的加總金額, flt_下單金額, expected",
    [
        (1000.0, 100.0, 10.0),
        (2000.0, 400.0, 20.0),
        (3000.0, 600.0, 20.0),
        (4000.0, 800.0, 20.0),
    ],
)
def test_get本階投入資金百分比(flt_一組金字塔的加總金額, flt_下單金額, expected):
    assert get本階投入資金百分比(flt_一組金字塔的加總金額, flt_下單金額) == expected


@pytest.mark.parametrize(
    "flt_起始價格, flt_當前價格, expected",
    [
        (100.0, 90.0, 10.0),
        (200.0, 180.0, 10.0),
        (300.0, 270.0, 10.0),
        (400.0, 360.0, 10.0),
    ],
)
def test_get累計下跌百分比(flt_起始價格, flt_當前價格, expected):
    assert get累計下跌百分比(flt_起始價格, flt_當前價格) == expected


@pytest.mark.parametrize(
    "dic_金字塔下單資料, flt_一組金字塔的加總金額, flt_起始價格, expected",
    [
        (
            {
                "各階資料": [
                    {"當次投資金額": 100.0, "價格": 90.0, "單位數": 1.0},
                    {"當次投資金額": 200.0, "價格": 80.0, "單位數": 2.0},
                ]
            },
            300.0,
            100.0,
            {
                "各階資料": [
                    {
                        "當次投資金額": 100.0,
                        "價格": 90.0,
                        "單位數": 1.0,
                        "投入百分比": 33.33,
                        "累計投入百分比": 33.33,
                        "累計投資金額": 100.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "當次投資金額": 200.0,
                        "價格": 80.0,
                        "單位數": 2.0,
                        "投入百分比": 66.67,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 300.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 300.0,
                "累計數量": 3.0,
                "平均成本": 100.0,
            },
        ),
    ],
)
def test_etl_percentage(
    dic_金字塔下單資料, flt_一組金字塔的加總金額, flt_起始價格, expected
):
    assert (
        etl_percentage(dic_金字塔下單資料, flt_一組金字塔的加總金額, flt_起始價格)
        == expected
    )


@pytest.mark.parametrize(
    "lst_買入價格, flt_最小增加數量, round單位數, i, flt_本階單位數, expected",
    [
        (
            [100.0, 90.0, 80.0],
            1.0,
            True,
            0,
            1.0,
            {"階": 1, "價格": 100.0, "單位數": 1.0, "當次投資金額": 100.0},
        ),
        (
            [100.0, 90.0, 80.0],
            1.0,
            True,
            1,
            2.0,
            {"階": 2, "價格": 90.0, "單位數": 2.0, "當次投資金額": 180.0},
        ),
        (
            [100.0, 90.0, 80.0],
            1.0,
            True,
            2,
            3.0,
            {"階": 3, "價格": 80.0, "單位數": 3.0, "當次投資金額": 240.0},
        ),
    ],
)
def test_get本階下單資料(
    lst_買入價格, flt_最小增加數量, round單位數, i, flt_本階單位數, expected
):
    assert (
        get本階下單資料(lst_買入價格, flt_最小增加數量, round單位數, i, flt_本階單位數)
        == expected
    )


# ====等差金字塔====


def get一組等差金字塔下單資料(
    flt_起始價格: float,
    int_交易次數: int,
    flt_下單數量等差參數: float,
    flt_起始單位數: float,
    lst_買入價格: list,
    flt_最小增加數量: float,
    flt_金字塔放大倍數: float = 1.0,
    round單位數: bool = False,
) -> dict:
    flt_一組金字塔的加總金額 = 0
    dic_單位等差金字塔下單資料 = {}
    lst_results = []
    for i in range(int_交易次數):
        # 本階金額 = 本階買入價格 * 本階單位數
        flt_本階單位數 = (
            flt_起始單位數 + (flt_下單數量等差參數 * i)
        ) * flt_金字塔放大倍數

        dic_本階下單資料 = get本階下單資料(
            lst_買入價格, flt_最小增加數量, round單位數, i, flt_本階單位數
        )

        # 階層數 = str(i + 1)
        # dic_單位等差金字塔下單資料[階層數] = dic_本階下單資料
        lst_results.append(dic_本階下單資料)
        flt_一組金字塔的加總金額 += dic_本階下單資料["當次投資金額"]

    # 處理各階層佔比
    dic_單位等差金字塔下單資料["各階資料"] = lst_results
    dic_單位等差金字塔下單資料 = etl_percentage(
        dic_單位等差金字塔下單資料, flt_一組金字塔的加總金額, flt_起始價格
    )

    print(f"{dic_單位等差金字塔下單資料=}")

    return dic_單位等差金字塔下單資料


@pytest.mark.parametrize(
    "flt_總預算, flt_起始價格, flt最終價格, int_交易次數, flt_最小增加數量, flt_下單數量等差參數, flt_起始單位數, expected",
    [
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            2.0,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 7.0,
                        "當次投資金額": 665.0,
                        "投入百分比": 6.68,
                        "累計投入百分比": 6.68,
                        "累計投資金額": 665.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 22.0,
                        "當次投資金額": 1980.0,
                        "投入百分比": 19.9,
                        "累計投入百分比": 26.58,
                        "累計投資金額": 2645.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 37.0,
                        "當次投資金額": 3145.0,
                        "投入百分比": 31.61,
                        "累計投入百分比": 58.19,
                        "累計投資金額": 5790.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 52.0,
                        "當次投資金額": 4160.0,
                        "投入百分比": 41.81,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 9950.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 9950.0,
                "累計數量": 118.0,
                "平均成本": 84.32,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            1.2,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 11.0,
                        "當次投資金額": 1045.0,
                        "投入百分比": 10.43,
                        "累計投入百分比": 10.43,
                        "累計投資金額": 1045.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 23.0,
                        "當次投資金額": 2070.0,
                        "投入百分比": 20.67,
                        "累計投入百分比": 31.1,
                        "累計投資金額": 3115.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 36.0,
                        "當次投資金額": 3060.0,
                        "投入百分比": 30.55,
                        "累計投入百分比": 61.66,
                        "累計投資金額": 6175.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 48.0,
                        "當次投資金額": 3840.0,
                        "投入百分比": 38.34,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10015.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10015.0,
                "累計數量": 118.0,
                "平均成本": 84.87,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            1.0,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 12.0,
                        "當次投資金額": 1140.0,
                        "投入百分比": 11.36,
                        "累計投入百分比": 11.36,
                        "累計投資金額": 1140.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 24.0,
                        "當次投資金額": 2160.0,
                        "投入百分比": 21.52,
                        "累計投入百分比": 32.88,
                        "累計投資金額": 3300.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 35.0,
                        "當次投資金額": 2975.0,
                        "投入百分比": 29.65,
                        "累計投入百分比": 62.53,
                        "累計投資金額": 6275.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 47.0,
                        "當次投資金額": 3760.0,
                        "投入百分比": 37.47,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10035.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10035.0,
                "累計數量": 118.0,
                "平均成本": 85.04,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            0.5,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 17.0,
                        "當次投資金額": 1615.0,
                        "投入百分比": 16.1,
                        "累計投入百分比": 16.1,
                        "累計投資金額": 1615.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 25.0,
                        "當次投資金額": 2250.0,
                        "投入百分比": 22.43,
                        "累計投入百分比": 38.53,
                        "累計投資金額": 3865.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 33.0,
                        "當次投資金額": 2805.0,
                        "投入百分比": 27.97,
                        "累計投入百分比": 66.5,
                        "累計投資金額": 6670.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 42.0,
                        "當次投資金額": 3360.0,
                        "投入百分比": 33.5,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10030.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10030.0,
                "累計數量": 117.0,
                "平均成本": 85.73,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            0.2,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 22.0,
                        "當次投資金額": 2090.0,
                        "投入百分比": 20.83,
                        "累計投入百分比": 20.83,
                        "累計投資金額": 2090.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 27.0,
                        "當次投資金額": 2430.0,
                        "投入百分比": 24.22,
                        "累計投入百分比": 45.04,
                        "累計投資金額": 4520.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 31.0,
                        "當次投資金額": 2635.0,
                        "投入百分比": 26.26,
                        "累計投入百分比": 71.3,
                        "累計投資金額": 7155.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 36.0,
                        "當次投資金額": 2880.0,
                        "投入百分比": 28.7,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10035.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10035.0,
                "累計數量": 116.0,
                "平均成本": 86.51,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            0.0,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 29.0,
                        "當次投資金額": 2755.0,
                        "投入百分比": 27.14,
                        "累計投入百分比": 27.14,
                        "累計投資金額": 2755.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 29.0,
                        "當次投資金額": 2610.0,
                        "投入百分比": 25.71,
                        "累計投入百分比": 52.86,
                        "累計投資金額": 5365.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 29.0,
                        "當次投資金額": 2465.0,
                        "投入百分比": 24.29,
                        "累計投入百分比": 77.14,
                        "累計投資金額": 7830.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 29.0,
                        "當次投資金額": 2320.0,
                        "投入百分比": 22.86,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10150.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10150.0,
                "累計數量": 116.0,
                "平均成本": 87.5,
            },
        ),
    ],
)
def test_get買入等差金字塔(
    flt_總預算,
    flt_起始價格,
    flt最終價格,
    int_交易次數,
    flt_最小增加數量,
    flt_下單數量等差參數,
    flt_起始單位數,
    expected,
):
    dic_result = get買入等差金字塔(
        flt_總預算,
        flt_起始價格,
        flt最終價格,
        int_交易次數,
        flt_最小增加數量,
        flt_下單數量等差參數,
        flt_起始單位數,
    )
    assert dic_result == expected


# ====等比金字塔====


@pytest.mark.parametrize(
    "flt_起始價格, int_交易次數, flt_下單數量等比參數, flt_起始單位數, lst_買入價格, flt_最小增加數量, flt_金字塔放大倍數, round單位數, expected",
    [
        (
            100.0,
            3,
            1.0,
            1.0,
            [100.0, 90.0, 80.0],
            1.0,
            1.0,
            False,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 100.0,
                        "單位數": 1.0,
                        "當次投資金額": 100.0,
                        "投入百分比": 37.04,
                        "累計投入百分比": 37.04,
                        "累計投資金額": 100.0,
                        "股價跌幅(%)": 0.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 1.0,
                        "當次投資金額": 90.0,
                        "投入百分比": 33.33,
                        "累計投入百分比": 70.37,
                        "累計投資金額": 190.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 80.0,
                        "單位數": 1.0,
                        "當次投資金額": 80.0,
                        "投入百分比": 29.63,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 270.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 270.0,
                "累計數量": 3.0,
                "平均成本": 90.0,
            },
        ),
    ],
)
def test_get一組等比金字塔下單資料(
    flt_起始價格,
    int_交易次數,
    flt_下單數量等比參數,
    flt_起始單位數,
    lst_買入價格,
    flt_最小增加數量,
    flt_金字塔放大倍數,
    round單位數,
    expected,
):
    dic_result = get一組等比金字塔下單資料(
        flt_起始價格,
        int_交易次數,
        flt_下單數量等比參數,
        flt_起始單位數,
        lst_買入價格,
        flt_最小增加數量,
        flt_金字塔放大倍數,
        round單位數,
    )
    assert dic_result == expected


@pytest.mark.parametrize(
    "flt_總預算, flt_起始價格, flt最終價格, int_交易次數, flt_最小增加數量, flt_下單數量等比參數, flt_起始單位數, expected",
    [
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            2.0,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 8.0,
                        "當次投資金額": 760.0,
                        "投入百分比": 7.57,
                        "累計投入百分比": 7.57,
                        "累計投資金額": 760.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 16.0,
                        "當次投資金額": 1440.0,
                        "投入百分比": 14.34,
                        "累計投入百分比": 21.91,
                        "累計投資金額": 2200.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 32.0,
                        "當次投資金額": 2720.0,
                        "投入百分比": 27.09,
                        "累計投入百分比": 49.0,
                        "累計投資金額": 4920.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 64.0,
                        "當次投資金額": 5120.0,
                        "投入百分比": 51.0,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10040.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10040.0,
                "累計數量": 120.0,
                "平均成本": 83.67,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            1.5,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 14.0,
                        "當次投資金額": 1330.0,
                        "投入百分比": 13.25,
                        "累計投入百分比": 13.25,
                        "累計投資金額": 1330.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 22.0,
                        "當次投資金額": 1980.0,
                        "投入百分比": 19.73,
                        "累計投入百分比": 32.98,
                        "累計投資金額": 3310.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 33.0,
                        "當次投資金額": 2805.0,
                        "投入百分比": 27.95,
                        "累計投入百分比": 60.94,
                        "累計投資金額": 6115.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 49.0,
                        "當次投資金額": 3920.0,
                        "投入百分比": 39.06,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10035.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10035.0,
                "累計數量": 118.0,
                "平均成本": 85.04,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            1.2,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 22.0,
                        "當次投資金額": 2090.0,
                        "投入百分比": 20.85,
                        "累計投入百分比": 20.85,
                        "累計投資金額": 2090.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 26.0,
                        "當次投資金額": 2340.0,
                        "投入百分比": 23.34,
                        "累計投入百分比": 44.19,
                        "累計投資金額": 4430.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 31.0,
                        "當次投資金額": 2635.0,
                        "投入百分比": 26.28,
                        "累計投入百分比": 70.47,
                        "累計投資金額": 7065.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 37.0,
                        "當次投資金額": 2960.0,
                        "投入百分比": 29.53,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10025.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10025.0,
                "累計數量": 116.0,
                "平均成本": 86.42,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            1.0,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 29.0,
                        "當次投資金額": 2755.0,
                        "投入百分比": 27.14,
                        "累計投入百分比": 27.14,
                        "累計投資金額": 2755.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 29.0,
                        "當次投資金額": 2610.0,
                        "投入百分比": 25.71,
                        "累計投入百分比": 52.86,
                        "累計投資金額": 5365.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 29.0,
                        "當次投資金額": 2465.0,
                        "投入百分比": 24.29,
                        "累計投入百分比": 77.14,
                        "累計投資金額": 7830.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 29.0,
                        "當次投資金額": 2320.0,
                        "投入百分比": 22.86,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 10150.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 10150.0,
                "累計數量": 116.0,
                "平均成本": 87.5,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            0.5,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 58.0,
                        "當次投資金額": 5510.0,
                        "投入百分比": 55.35,
                        "累計投入百分比": 55.35,
                        "累計投資金額": 5510.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 29.0,
                        "當次投資金額": 2610.0,
                        "投入百分比": 26.22,
                        "累計投入百分比": 81.57,
                        "累計投資金額": 8120.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 15.0,
                        "當次投資金額": 1275.0,
                        "投入百分比": 12.81,
                        "累計投入百分比": 94.37,
                        "累計投資金額": 9395.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 7.0,
                        "當次投資金額": 560.0,
                        "投入百分比": 5.63,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 9955.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 9955.0,
                "累計數量": 109.0,
                "平均成本": 91.33,
            },
        ),
        (
            10000.0,
            100.0,
            80.0,
            4,
            1.0,
            0.2,
            1.0,
            {
                "各階資料": [
                    {
                        "階": 1,
                        "價格": 95.0,
                        "單位數": 85.0,
                        "當次投資金額": 8075.0,
                        "投入百分比": 81.24,
                        "累計投入百分比": 81.24,
                        "累計投資金額": 8075.0,
                        "股價跌幅(%)": 5.0,
                    },
                    {
                        "階": 2,
                        "價格": 90.0,
                        "單位數": 17.0,
                        "當次投資金額": 1530.0,
                        "投入百分比": 15.39,
                        "累計投入百分比": 96.63,
                        "累計投資金額": 9605.0,
                        "股價跌幅(%)": 10.0,
                    },
                    {
                        "階": 3,
                        "價格": 85.0,
                        "單位數": 3.0,
                        "當次投資金額": 255.0,
                        "投入百分比": 2.57,
                        "累計投入百分比": 99.2,
                        "累計投資金額": 9860.0,
                        "股價跌幅(%)": 15.0,
                    },
                    {
                        "階": 4,
                        "價格": 80.0,
                        "單位數": 1.0,
                        "當次投資金額": 80.0,
                        "投入百分比": 0.8,
                        "累計投入百分比": 100.0,
                        "累計投資金額": 9940.0,
                        "股價跌幅(%)": 20.0,
                    },
                ],
                "起始價格": 100.0,
                "最終價格": 80.0,
                "股價跌幅(%)": 20.0,
                "總投入金額": 9940.0,
                "累計數量": 106.0,
                "平均成本": 93.77,
            },
        ),
    ],
)
def test_get買入等比金字塔(
    flt_總預算,
    flt_起始價格,
    flt最終價格,
    int_交易次數,
    flt_最小增加數量,
    flt_下單數量等比參數,
    flt_起始單位數,
    expected,
):
    dic_result = get買入等比金字塔(
        flt_總預算,
        flt_起始價格,
        flt最終價格,
        int_交易次數,
        flt_最小增加數量,
        flt_下單數量等比參數,
        flt_起始單位數,
    )
    assert dic_result == expected


if __name__ == "__main__":
    pytest.main([__file__])
